In [1]:
from google.colab import drive
drive.mount('/content/gdrive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/gdrive

In [0]:
import pandas as pd

In [12]:
product = pd.read_csv('/content/gdrive/My Drive/LPOINT/01.Product.csv')
search1 = pd.read_csv('/content/gdrive/My Drive/LPOINT/02.Search1.csv')
search2 = pd.read_csv('/content/gdrive/My Drive/LPOINT/03.Search2.csv')
custom = pd.read_csv('/content/gdrive/My Drive/LPOINT/04.Custom.csv')
session = pd.read_csv('/content/gdrive/My Drive/LPOINT/05.Session.csv')
master = pd.read_csv('/content/gdrive/My Drive/LPOINT/06.Master.csv')

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (7) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [13]:
print(product.shape)
print(search1.shape)
print(search2.shape)
print(custom.shape)
print(session.shape)
print(master.shape)

(5024906, 8)
(2884943, 4)
(8051172, 3)
(671679, 3)
(2712907, 9)
(847652, 5)

In [4]:
product.head()

   CLNT_ID   SESS_ID  HITS_SEQ  ...  PD_BRA_NM PD_BUY_AM PD_BUY_CT
0  4139680   7605037        12  ...    [바비브라운]    39,000         1
1  4140076  10189797        13  ...        데상트    39,000         2
2  4142395   6158159        85  ...      [아베다]    39,000         1
3  4144914   7935714        12  ...    아디다스 키즈    39,000         1
4  4144917   6406509        78  ...       데코르테    39,000         5

[5 rows x 8 columns]

In [9]:
search1.head()

   CLNT_ID  SESS_ID     KWD_NM  SEARCH_CNT
0  5607714  7112876   빌리프 아이크림           6
1  5607714  4090791  프리메라 마스크팩           3
2  5607714  4090791      여성청결제           1
3  5612428  1876482       명품가방           1
4  5612428   658123  콩순이 아이스크림           1

In [14]:
search2.head()

    SESS_DT     KWD_NM SEARCH_CNT
0  20180407      닥스원피스          8
1  20180407  닥터지 브라이트닝          1
2  20180407     달팡 인트랄          2
3  20180407        대상트          1
4  20180407       더블유닷          6

In [15]:
custom.head()

   CLNT_ID CLNT_GENDER  CLNT_AGE
0  4830726           F        30
1  4830874           F        40
2  4830975           F        30
3  4831275           F        30
4  4825325           F        30

In [16]:
session.head()

   CLNT_ID   SESS_ID  SESS_SEQ  ...  DVC_CTG_NM       ZON_NM  CITY_NM
0  5873599   8641867         9  ...      mobile      Daejeon  Daejeon
1  5873599   6616320        21  ...      mobile        Busan    Busan
2  5873599   5886172        40  ...      mobile      Daejeon  Daejeon
3  5873884   1050889        15  ...      mobile  Gyeonggi-do   Anyang
4  5874461  10298270         5  ...      mobile        Seoul    Seoul

[5 rows x 9 columns]

In [17]:
master.head()

    PD_C  ...  CLAC3_NM
0  64382  ...  남성스포츠티셔츠
1  62282  ...    여성일반양말
2  61729  ...  영유아티셔츠/탑
3  61537  ...      남성부츠
4  58820  ...    남성남방셔츠

[5 rows x 5 columns]